NextFOAM-2407/tutorials/multiphase/icoReactingMultiphaseInterFoam/oxideFormation/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomInlet
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }

    topOutlet
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }

    "(left|right|front|back|bottomLeft|bottomRight)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
